# https://back.engineering/blog/29/03/2021/

<!DOCTYPE html><html itemscope="" class="dark" lang="en-us" itemtype="http://schema.org/WebPage"><body><div class="search-modal" aria-hidden="true" style="--color-primary:#121212"><div data-target="close-search-modal" class="search-modal-overlay"></div><div class="search-wrapper" data-image="true" data-description="true" data-tags="true" data-categories="true"><div class="search-wrapper-header"><label for="search-modal-input" style="margin-top:-1px"><span class="sr-only">search icon</span>
<svg viewBox="0 0 512 512" height="18" width="18" class="search-icon" data-type="search" style="display: initial;"><path fill="currentColor" d="M416 208c0 45.9-14.9 88.3-40 122.7L502.6 457.4c12.5 12.5 12.5 32.8.0 45.3s-32.8 12.5-45.3.0L330.7 376c-34.4 25.2-76.8 40-122.7 40C93.1 416 0 322.9.0 208S93.1.0 208 0 416 93.1 416 208zM208 352a144 144 0 100-288 144 144 0 100 288z"></path></svg>
<svg viewBox="0 0 512 512" height="18" width="18" class="search-reset" data-type="reset" style="display: none;"><path fill="currentColor" d="M256 512A256 256 0 10256 0a256 256 0 100 512zM175 175c9.4-9.4 24.6-9.4 33.9.0l47 47 47-47c9.4-9.4 24.6-9.4 33.9.0s9.4 24.6.0 33.9l-47 47 47 47c9.4 9.4 9.4 24.6.0 33.9s-24.6 9.4-33.9.0l-47-47-47 47c-9.4 9.4-24.6 9.4-33.9.0s-9.4-24.6.0-33.9l47-47-47-47c-9.4-9.4-9.4-24.6.0-33.9z"></path></svg>
</label><input id="search-modal-input" type="text" data-search-input="" autocomplete="off" aria-label="Search" placeholder="Search Post..."></div><div class="search-wrapper-body"><div class="search-result" data-search-result=""></div><span class="search-result-empty"></span></div><div class="search-wrapper-footer"><span><kbd><svg width="14" height="14" fill="currentColor" viewBox="0 0 16 16"><path d="M3.204 11h9.592L8 5.519 3.204 11zm-.753-.659 4.796-5.48a1 1 0 011.506.0l4.796 5.48c.566.647.106 1.659-.753 1.659H3.204a1 1 0 01-.753-1.659z"></path></svg>
</kbd><kbd><svg width="14" height="14" fill="currentColor" style="margin-top:1px" viewBox="0 0 16 16"><path d="M3.204 5h9.592L8 10.481 3.204 5zm-.753.659 4.796 5.48a1 1 0 001.506.0l4.796-5.48c.566-.647.106-1.659-.753-1.659H3.204a1 1 0 00-.753 1.659z"></path></svg>
</kbd>to navigate
</span><span><kbd><svg width="12" height="12" fill="currentColor" style="display:inline-block" viewBox="0 0 16 16"><path fill-rule="evenodd" d="M14.5 1.5a.5.5.0 01.5.5v4.8a2.5 2.5.0 01-2.5 2.5H2.707l3.347 3.346a.5.5.0 01-.708.708l-4.2-4.2a.5.5.0 010-.708l4-4a.5.5.0 11.708.708L2.707 8.3H12.5A1.5 1.5.0 0014 6.8V2a.5.5.0 01.5-.5z"></path></svg>
</kbd>to select
</span><span class="search-result-info"></span>
<span data-target="close-search-modal"><kbd>ESC</kbd> to close</span></div></div></div><main><section class="section pt-7"><div class="container"><div class="row justify-center"><article class="lg:col-10"><h1 class="h2 mb-4">Hyperspace - Hidden Address Spaces</h1><ul class="mb-4"><li class="mr-4 inline-block"><a href="https://back.engineering/authors/idontcode/"><i class="fa-regular fa-circle-user mr-2"></i>IDontCode</a></li><li class="mr-4 inline-block"><i class="fa-regular fa-folder mr-2"></i>
<a href="https://back.engineering/categories/windows/">Windows</a></li><li class="mr-4 inline-block"><i class="fa-regular fa-clock mr-2"></i>
March 29, 2021</li></ul><div class="content mb-10"><details open="" class="table-of-content blog"><summary>Table of Contents</summary></details><p>Download link: <a href="https://githacks.org/_xeroxz/hyperspace">Hyperspace</a></p><h3 id="table-of-contents">Table Of Contents</h3><ul><li><a href="https://back.engineering/blog/29/03/2021/#intro">Introduction - Address Spaces</a></li><li><a href="https://back.engineering/blog/29/03/2021/#thread-scheduler">Thread Scheduler - Trap Frames and Control Registers</a></li><li><a href="https://back.engineering/blog/29/03/2021/#DKOM">DKOM - Direct Kernel Object Manipulation</a></li><li><a href="https://back.engineering/blog/29/03/2021/#windows-memory-manager">Windows Memory Manager - MiStealPage</a></li><li><a href="https://back.engineering/blog/29/03/2021/#example">Example - printf, malloc, etc</a></li><li><a href="https://back.engineering/blog/29/03/2021/#conclusions">Limitations - Crashes and Conclusions</a></li></ul><h2 id="intro">Introduction - Address Spaces</h2><p>An address space is defined as a region of memory. In this post I will be referring to an address space in reference to a 64bit virtual address space on x86 architecture. <em><strong>Control Register Three (CR3)</strong></em> contains the <em><strong>PFN (Page Frame Number)</strong></em> of the current <em><strong>Page Map Level Four (PML4)</strong></em>. It is also known as dirbase.</p><p>On Windows, each process has its own virtual address space. The CR3 value loaded into a logical processor is located inside of the KPROCESS structure.</p><pre tabindex="0"><code>&gt; dt -r _EPROCESS
ntdll!_EPROCESS
   +0x000 Pcb              : _KPROCESS
      +0x000 Header           : _DISPATCHER_HEADER
         +0x000 Lock             : Int4B
         +0x000 LockNV           : Int4B
         +0x000 Type             : UChar
         +0x001 Signalling       : UChar
         +0x002 Size             : UChar
         +0x003 Reserved1        : UChar
         +0x000 TimerType        : UChar
         // ....
         +0x000 MutantType       : UChar
         +0x001 MutantSize       : UChar
         +0x002 DpcActive        : UChar
         +0x003 MutantReserved   : UChar
         +0x004 SignalState      : Int4B
         +0x008 WaitListHead     : _LIST_ENTRY
      +0x018 ProfileListHead  : _LIST_ENTRY
         +0x000 Flink            : Ptr64 _LIST_ENTRY
         +0x008 Blink            : Ptr64 _LIST_ENTRY
      +0x028 DirectoryTableBase : Uint8B &lt;==== CR3 value
</code></pre><p><em><strong>Figure 1. EPROCESS contains a substruct of KPROCESS which contains DirectoryTableBase</strong></em></p><h2 id="thread-scheduler">Thread Scheduler - Trap Frames and Control Registers</h2><p>The Windows thread scheduler is responsible for scheduling logical processors (LP’s) to execute threads. A LP contains the current processor control block at the segment base of GS. This structure contains many things, many substructures, and most importantly the current KTHREAD.</p><pre tabindex="0"><code>&gt; dt _KPCR
ntdll!_KPCR
   +0x000 NtTib            : _NT_TIB
   +0x000 GdtBase          : Ptr64 _KGDTENTRY64
   +0x008 TssBase          : Ptr64 _KTSS64
   +0x010 UserRsp          : Uint8B
   +0x018 Self             : Ptr64 _KPCR
   +0x020 CurrentPrcb      : Ptr64 _KPRCB ; KPRCB contains KTHREAD

&gt; dt _KPRCB
ntdll!_KPRCB
   +0x000 MxCsr            : Uint4B
   +0x004 LegacyNumber     : UChar
   +0x005 ReservedMustBeZero : UChar
   +0x006 InterruptRequest : UChar
   +0x007 IdleHalt         : UChar
   +0x008 CurrentThread    : Ptr64 _KTHREAD ; KTHREAD contains KAPC_STATE

&gt; dt _KTHREAD
ntdll!_KTHREAD
   +0x000 Header           : _DISPATCHER_HEADER
   +0x018 SListFaultAddress : Ptr64 Void
   +0x020 QuantumTarget    : Uint8B
   +0x028 InitialStack     : Ptr64 Void
   // ...
   +0x080 SystemCallNumber : Uint4B
   +0x084 ReadyTime        : Uint4B
   +0x088 FirstArgument    : Ptr64 Void
   +0x090 TrapFrame        : Ptr64 _KTRAP_FRAME
   +0x098 ApcState         : _KAPC_STATE ; APC state contains KPROCESS
</code></pre><p><em><strong>Figure 2. KPCR-&gt;CurrentPrcb-&gt;CurrentThread-&gt;ApcState.Process to get current KPROCESS</strong></em></p><p>When a LP gets interrupted and rescheduled, all general purpose registers are moved into a trap frame, which is then located inside of the KTHREAD. When a LP gets interrupted in usermode, the trap frame <em><strong>KUMS_CONTEXT_HEADER</strong></em> is used, this also contains a <em><strong>KTRAP_FRAME</strong></em>. If a LP gets interrupted in CPL0 the KTRAP_FRAME is just used.</p><pre tabindex="0"><code>&gt; dt _KTRAP_FRAME
ntdll!_KTRAP_FRAME
   +0x000 P1Home           : Uint8B
   +0x008 P2Home           : Uint8B
   +0x010 P3Home           : Uint8B
   +0x018 P4Home           : Uint8B
   +0x020 P5               : Uint8B
   +0x028 PreviousMode     : Char
   +0x028 InterruptRetpolineState : UChar
   +0x029 PreviousIrql     : UChar
   +0x02a FaultIndicator   : UChar
   +0x02a NmiMsrIbrs       : UChar
   +0x02b ExceptionActive  : UChar
   +0x02c MxCsr            : Uint4B
   +0x030 Rax              : Uint8B
   +0x038 Rcx              : Uint8B
   +0x040 Rdx              : Uint8B
   +0x048 R8               : Uint8B
   +0x050 R9               : Uint8B
   +0x058 R10              : Uint8B
   +0x060 R11              : Uint8B
   +0x068 GsBase           : Uint8B
   +0x068 GsSwap           : Uint8B
   +0x070 Xmm0             : _M128A
   +0x080 Xmm1             : _M128A
   +0x090 Xmm2             : _M128A
   +0x0a0 Xmm3             : _M128A
   +0x0b0 Xmm4             : _M128A
   +0x0c0 Xmm5             : _M128A
   +0x0d0 FaultAddress     : Uint8B
   +0x0d0 ContextRecord    : Uint8B
   +0x0d8 Dr0              : Uint8B
   +0x0e0 Dr1              : Uint8B
   +0x0e8 Dr2              : Uint8B
   +0x0f0 Dr3              : Uint8B
   +0x0f8 Dr6              : Uint8B
   +0x100 Dr7              : Uint8B
   +0x108 DebugControl     : Uint8B
   +0x110 LastBranchToRip  : Uint8B
   +0x118 LastBranchFromRip : Uint8B
   +0x120 LastExceptionToRip : Uint8B
   +0x128 LastExceptionFromRip : Uint8B
   +0x130 SegDs            : Uint2B
   +0x132 SegEs            : Uint2B
   +0x134 SegFs            : Uint2B
   +0x136 SegGs            : Uint2B
   +0x138 TrapFrame        : Uint8B
   +0x140 Rbx              : Uint8B
   +0x148 Rdi              : Uint8B
   +0x150 Rsi              : Uint8B
   +0x158 Rbp              : Uint8B
   +0x160 ErrorCode        : Uint8B
   +0x160 ExceptionFrame   : Uint8B
   +0x168 Rip              : Uint8B
   // ...
</code></pre><p><em><strong>Figure 3. trapped registers, notice no CR3.</strong></em></p><p>As you can see from above, CR3 is not included in this trap frame. This is because the windows thread scheduler loads CR3 from KPROCESS-&gt;DirectoryTableBase. The thread scheduler gets the KPROCESS from KTHREAD-&gt;ApcState.Process (PsGetCurrentProcess).</p><div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4"><code class="language-cpp" data-lang="cpp"><span style="display:flex"><span>v15 <span style="color:#f92672">=</span> v4<span style="color:#f92672">-&gt;</span>ApcState.Process;
